re20_1/system/blockMeshDict
// Generated by Chase Holder 

// R = 1
// L_f = 4.00
// L_w = 8.00
// H = 4.00


FoamFile
{
    version  2.0;
    format   ascii;
    class    dictionary;
    object   blockMeshDict;
}

convertToMeters 1.0;

vertices
(
    ( 0.50000000  0.00000000  -0.05) // 0 
    ( 0.35355339  0.35355339  -0.05) // 1 
    ( 0.00000000  0.50000000  -0.05) // 2 
    (-0.35355339  0.35355339  -0.05) // 3 
    (-0.50000000  0.00000000  -0.05) // 4 
    (-0.35355339 -0.35355339  -0.05) // 5 
    (-0.00000000 -0.50000000  -0.05) // 6 
    ( 0.35355339 -0.35355339  -0.05) // 7 
    ( 1.50000000  0.00000000  -0.05) // 8 
    ( 1.06066017  1.06066017  -0.05) // 9 
    ( 0.00000000  1.50000000  -0.05) // 10 
    (-1.06066017  1.06066017  -0.05) // 11 
    (-1.50000000  0.00000000  -0.05) // 12 
    (-1.06066017 -1.06066017  -0.05) // 13 
    (-0.00000000 -1.50000000  -0.05) // 14 
    ( 1.06066017 -1.06066017  -0.05) // 15 
    ( 8.00000000  0.00000000  -0.05) // 16 
    ( 8.00000000  1.06066017  -0.05) // 17 
    ( 8.00000000  4.00000000  -0.05) // 18 
    ( 1.06066017  4.00000000  -0.05) // 19 
    ( 0.00000000  4.00000000  -0.05) // 20 
    (-1.06066017  4.00000000  -0.05) // 21 
    (-4.00000000  4.00000000  -0.05) // 22 
    (-4.00000000  1.06066017  -0.05) // 23 
    (-4.00000000  0.00000000  -0.05) // 24 
    (-4.00000000 -1.06066017  -0.05) // 25 
    (-4.00000000 -4.00000000  -0.05) // 26 
    (-1.06066017 -4.00000000  -0.05) // 27 
    ( 0.00000000 -4.00000000  -0.05) // 28 
    ( 1.06066017 -4.00000000  -0.05) // 29 
    ( 8.00000000 -4.00000000  -0.05) // 30 
    ( 8.00000000 -1.06066017  -0.05) // 31 
    ( 0.50000000  0.00000000   0.05) // 32 
    ( 0.35355339  0.35355339   0.05) // 33 
    ( 0.00000000  0.50000000   0.05) // 34 
    (-0.35355339  0.35355339   0.05) // 35 
    (-0.50000000  0.00000000   0.05) // 36 
    (-0.35355339 -0.35355339   0.05) // 37 
    (-0.00000000 -0.50000000   0.05) // 38 
    ( 0.35355339 -0.35355339   0.05) // 39 
    ( 1.50000000  0.00000000   0.05) // 40 
    ( 1.06066017  1.06066017   0.05) // 41 
    ( 0.00000000  1.50000000   0.05) // 42 
    (-1.06066017  1.06066017   0.05) // 43 
    (-1.50000000  0.00000000   0.05) // 44 
    (-1.06066017 -1.06066017   0.05) // 45 
    (-0.00000000 -1.50000000   0.05) // 46 
    ( 1.06066017 -1.06066017   0.05) // 47 
    ( 8.00000000  0.00000000   0.05) // 48 
    ( 8.00000000  1.06066017   0.05) // 49 
    ( 8.00000000  4.00000000   0.05) // 50 
    ( 1.06066017  4.00000000   0.05) // 51 
    ( 0.00000000  4.00000000   0.05) // 52 
    (-1.06066017  4.00000000   0.05) // 53 
    (-4.00000000  4.00000000   0.05) // 54 
    (-4.00000000  1.06066017   0.05) // 55 
    (-4.00000000  0.00000000   0.05) // 56 
    (-4.00000000 -1.06066017   0.05) // 57 
    (-4.00000000 -4.00000000   0.05) // 58 
    (-1.06066017 -4.00000000   0.05) // 59 
    ( 0.00000000 -4.00000000   0.05) // 60 
    ( 1.06066017 -4.00000000   0.05) // 61 
    ( 8.00000000 -4.00000000   0.05) // 62 
    ( 8.00000000 -1.06066017   0.05) // 63 
);

blocks
(
   // block 0
   hex (0 8 9 1 32 40 41 33) (10 8 1) simpleGrading (2.0 1.0 1.0)

   // block 1
   hex (1 9 10 2 33 41 42 34) (10 8 1) simpleGrading (2.0 1.0 1.0)

   // block 2
   hex (2 10 11 3 34 42 43 35) (10 8 1) simpleGrading (2.0 1.0 1.0)

   // block 3
   hex (3 11 12 4 35 43 44 36) (10 8 1) simpleGrading (2.0 1.0 1.0)

   // block 4
   hex (4 12 13 5 36 44 45 37) (10 8 1) simpleGrading (2.0 1.0 1.0)

   // block 5
   hex (5 13 14 6 37 45 46 38) (10 8 1) simpleGrading (2.0 1.0 1.0)

   // block 6
   hex (6 14 15 7 38 46 47 39) (10 8 1) simpleGrading (2.0 1.0 1.0)

   // block 7
   hex (7 15 8 0 39 47 40 32) (10 8 1) simpleGrading (2.0 1.0 1.0)

   // block 8
   hex (8 16 17 9 40 48 49 41) (24 8 1) simpleGrading (1.0 1.0 1.0)

   // block 9
   hex (9 17 18 19 41 49 50 51) (24 12 1) simpleGrading (1.0 1.0 1.0)

   // block 10
   hex (9 19 20 10 41 51 52 42) (12 8 1) simpleGrading (1.0 1.0 1.0)

   // block 11
   hex (10 20 21 11 42 52 53 43) (12 8 1) simpleGrading (1.0 1.0 1.0)

   // block 12
   hex (11 21 22 23 43 53 54 55) (12 8 1) simpleGrading (1.0 1.0 1.0)

   // block 13
   hex (11 23 24 12 43 55 56 44) (8 8 1) simpleGrading (1.0 1.0 1.0)

   // block 14
   hex (12 24 25 13 44 56 57 45) (8 8 1) simpleGrading (1.0 1.0 1.0)

   // block 15
   hex (13 25 26 27 45 57 58 59) (8 12 1) simpleGrading (1.0 1.0 1.0)

   // block 16
   hex (13 27 28 14 45 59 60 46) (12 8 1) simpleGrading (1.0 1.0 1.0)

   // block 17
   hex (14 28 29 15 46 60 61 47) (12 8 1) simpleGrading (1.0 1.0 1.0)

   // block 18
   hex (15 29 30 31 47 61 62 63) (12 24 1) simpleGrading (1.0 1.0 1.0)

   // block 19
   hex (15 31 16 8 47 63 48 40) (24 8 1) simpleGrading (1.0 1.0 1.0)

);


edges
(

arc 0 1 ( 0.46193977  0.19134172 -0.05) 
arc 1 2 ( 0.19134172  0.46193977 -0.05) 
arc 2 3 (-0.19134172  0.46193977 -0.05) 
arc 3 4 (-0.46193977  0.19134172 -0.05) 
arc 4 5 (-0.46193977 -0.19134172 -0.05) 
arc 5 6 (-0.19134172 -0.46193977 -0.05) 
arc 6 7 ( 0.19134172 -0.46193977 -0.05) 
arc 7 0 ( 0.46193977 -0.19134172 -0.05) 
arc 8 9 ( 1.38581930  0.57402515 -0.05) 
arc 9 10 ( 0.57402515  1.38581930 -0.05) 
arc 10 11 (-0.57402515  1.38581930 -0.05) 
arc 11 12 (-1.38581930  0.57402515 -0.05) 
arc 12 13 (-1.38581930 -0.57402515 -0.05) 
arc 13 14 (-0.57402515 -1.38581930 -0.05) 
arc 14 15 ( 0.57402515 -1.38581930 -0.05) 
arc 15 8 ( 1.38581930 -0.57402515 -0.05) 
arc 32 33 ( 0.46193977  0.19134172  0.05) 
arc 33 34 ( 0.19134172  0.46193977  0.05) 
arc 34 35 (-0.19134172  0.46193977  0.05) 
arc 35 36 (-0.46193977  0.19134172  0.05) 
arc 36 37 (-0.46193977 -0.19134172  0.05) 
arc 37 38 (-0.19134172 -0.46193977  0.05) 
arc 38 39 ( 0.19134172 -0.46193977  0.05) 
arc 39 32 ( 0.46193977 -0.19134172  0.05) 
arc 40 41 ( 1.38581930  0.57402515  0.05) 
arc 41 42 ( 0.57402515  1.38581930  0.05) 
arc 42 43 (-0.57402515  1.38581930  0.05) 
arc 43 44 (-1.38581930  0.57402515  0.05) 
arc 44 45 (-1.38581930 -0.57402515  0.05) 
arc 45 46 (-0.57402515 -1.38581930  0.05) 
arc 46 47 ( 0.57402515 -1.38581930  0.05) 
arc 47 40 ( 1.38581930 -0.57402515  0.05) 
);

boundary
(

   inlet
   {
      type patch;
      faces
      (
         (22 54 55 23)
         (23 55 56 24)
         (24 56 57 25)
         (25 57 58 26)
      );
   }

   outlet
   {
      type patch;
      faces
      (
         (18 50 49 17)
         (17 49 48 16)
         (16 48 63 31)
         (31 63 62 30)
      );
   }

   cylinder
   {
      type wall;
      faces
      (
         (0 32 33 1)
         (1 33 34 2)
         (2 34 35 3)
         (3 35 36 4)
         (4 36 37 5)
         (5 37 38 6)
         (6 38 39 7)
         (7 39 32 0)
      );
   }

   top
   {
      type symmetryPlane;
      faces
      (
         (22 54 53 21)
         (21 53 52 20)
         (20 52 51 19)
         (19 51 50 18)
      );
   }

   bottom
   {
      type symmetryPlane;
      faces
      (
         (26 58 59 27)
         (27 59 60 28)
         (28 60 61 29)
         (29 61 62 30)
      );
   }

);